
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.товары.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТабЧасть = Элементы.Товары;
	ТекущиеДанные = ТабЧасть.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаСообщения = "Изменилась колонка Количество";

	РассчитатьСуммуВСтроке(ТекущиеДанные, СтрокаСообщения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуВСтроке(Строка, ТекстСообщения)

	Строка.Сумма = Строка.Цена * Строка.Количество;
	Сотрудник = ОписаниеСотрудника();
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (Сотрудник.Имя);
	Сообщение.Сообщить();

	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (ТекстСообщения);
	Сообщение.Сообщить();

	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеСотрудника()
	
	Пользователь = Новый Соответствие;
	Пользователь.Вставить("Имя", "Чаусов Антон Алексеевич"); 
	Пользователь.Вставить("ДатаРождения", ТекущаяДата());
	Пользователь.Вставить("Стаж", 14);
	Пользователь.Вставить("Штатный", Истина);
	
	Возврат Пользователь;
	
КонецФункции

#КонецОбласти